# Напишите программу, которая считывает три числа и подсчитывает количество чётных чисел.
num = int(input())
if num in [2, 4, 6, 8]:
    print('число четное')
else:
    print('число не четное')
